# Dict01.py

# Dictionary : 사전 <-- {key1 : value1, k2 : v2, ...}
# keys() : key만 호출, values() : value만, items() : 둘돠

a = {10, 20, 30} # set
b = {} # dict
c = set() # 빈 set, list(), dict(), tuple()
d = {10:"사과", 20:"배", 30:"토마토", "쀼쀼":"메론"}

print(type(a), type(b), type(c), type(d))
print(d[10], d["쀼쀼"])
print("{}\n{}\n{}".format(d.keys(), d.values(), d.items()))

d["쀼쀼"] = '포도'
print(d["쀼쀼"])

d["뾰뾰"] = "메론"
print(d["뾰뾰"])
print(d)
###################################################

직원01 = {"이름" : "홍길동",
          "사번" : 1001,
          "자격증" : ['운전', '한국사', '컴활']}

print(직원01)
print(type(직원01["자격증"])) # list type


학생01 = {"이름" : "홍길동",
          '학번' : 1001,
          '과목별점수' : {'국어':67, '수학':78, '영어':90}}

print(학생01)
print(type(학생01["과목별점수"])) # dict type

학생02 = {"이름" : "김연아",
          '학번' : 1002,
          '과목별점수' : {'국어':100, '수학':100, '영어':100}}

학생03 = {"이름" : "이승엽",
          '학번' : 1003,
          '과목별점수' : {'국어':46, '수학':51, '영어':40}}


학생들 = [학생01, 학생02, 학생03] # list로 저장

# 첫번째 학생의 학번, 두번째 학생의 영어점수를 출력
print("첫번째 학생 학번 : {}\n\
두번째 학생의 영어점수 : {}\n".format(학생들[0]["학번"], 학생들[1]["과목별점수"]["영어"]))































